Kelas PSD C

Ketua Kelompok
NIM :  200411100039
Nama : Amelia Nur Septiyasari

Anggota Kelompok
NIM : 200411100148
Nama : Fadilatul Jannah

Github Ketua : https://github.com/Amelia039/kolaborasipro

In [1]:
import pandas as pd
show_csv = pd.read_csv('https://raw.githubusercontent.com/Amelia039/my-dataset/main/Electric_Production.csv')
show_csv

          DATE  IPG2211A2N
0     1/1/1985     72.5052
1     2/1/1985     70.6720
2     3/1/1985     62.4502
3     4/1/1985     57.4714
4     5/1/1985     55.3151
..         ...         ...
392   9/1/2017     98.6154
393  10/1/2017     93.6137
394  11/1/2017     97.3359
395  12/1/2017    114.7212
396   1/1/2018    129.4048

[397 rows x 2 columns]